<?php
/* โจทย์ข้อที่ 1 (30 คะแนน)
/จงเขียน function findToSum(Array $arrNumber, Integer $intSum);
หาผลบวกใน $arrNumber ที่รับเข้ามา บวกกันแล้วมีค่าเท่ากับ ตัวแปร $intSum และ Return ผลลัพธิ์เป็น Array
ข้อกำหนด
-	รับ Parameter 2 ตัว โดยตัวแรก รับเป็น อาเรย์ตัวเลขจำนวนเต็ม และ ตัวที่สองรับเป็นเลขจำนวนเต็ม
-	จับคู่ตัวเลขในอาเรย์ที่บวกกันแล้วได้ค่าเท่ากับพารามิเตอร์ตัวที่สอง
-	ตัวเลขที่จับคู่แล้วจะไม่สามารถนำมาใช้ได้อีก เช่น
ขยายความ ก. 1+4=5 และ 4+1=5 ระบบจะต้องเลือก 1+4 แค่ตัวเดียว จะไม่สามารถใช้ 4+1
ขยายความ ข. 2+3=5 และ 3+2=5 ระบบจะต้องเลือก 2+3 แค่ตัวเดียว จะไม่สามารถใช้ 3+2
*/
?>